{
  "backend/main.mo": "Defines the main Motoko canister with storage mixins, authorization, Stripe config, ERP data types, and persistent state maps for users, classes, attendance, grades, fees, announcements, and library items.",
  "feature_evidence.json": "Feature evidence report mapping implemented features to source files, components, and test IDs.",
  "frontend-file-summaries.txt": "Contains prewritten summaries for various frontend files including layouts, pages, components, and 3D features.",
  "frontend/index.css": "Tailwind CSS configuration defining theming variables for light and dark modes and applying global styles.",
  "frontend/index.html": "HTML entry file that loads the main React application via main.tsx.",
  "frontend/src/App.tsx": "Sets up the main TanStack Router structure with public and ERP routes, layouts, and global providers.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal for first‑time users to enter and save profile details using a mutation hook.",
  "frontend/src/components/auth/RequireAuth.tsx": "Route guard that checks Internet Identity auth state and redirects unauthenticated users to the ERP login page.",
  "frontend/src/components/brand/SchoolLogo.tsx": "Reusable logo component linking to the home page and displaying the school’s generated logo.",
  "frontend/src/components/layout/ErpLayout.tsx": "Defines the ERP dashboard layout with role‑filtered navigation, sidebar toggling, profile setup modal, and logout handling.",
  "frontend/src/components/layout/PublicFooter.tsx": "Renders the public site footer with links, contact info, and a dynamic attribution section.",
  "frontend/src/components/layout/PublicLayout.tsx": "Wraps public pages with navigation, main content area, and footer.",
  "frontend/src/components/layout/PublicNav.tsx": "Implements the public navigation bar with responsive mobile menu, links, theme toggle, and ERP login button.",
  "frontend/src/components/theme/ThemeProvider.tsx": "Provides theme context with light/dark/system modes and syncs resolved theme to the DOM.",
  "frontend/src/components/theme/ThemeToggle.tsx": "Button component that switches between light and dark themes.",
  "frontend/src/components/three/PanoramaViewer.tsx": "Displays a 360° panorama viewer using three.js with orbit controls.",
  "frontend/src/components/three/SchoolHero3D.tsx": "Renders a simple 3D school scene with camera controls for the homepage hero section.",
  "frontend/src/components/three/SchoolHeroFallback.tsx": "Fallback static image for environments without WebGL or 3D support.",
  "frontend/src/components/three/tourSpots.ts": "Exports predefined 360° tour spots with names and image URLs.",
  "frontend/src/components/three/WebGLSupport.ts": "Hook that detects WebGL support and device capability to determine if 3D features should run.",
  "frontend/src/hooks/queries/useCallerProfile.ts": "React Query hooks to fetch and update the authenticated user's profile and role from the backend actor.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor and invalidates dependent queries on changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an authentication context and React provider for managing Internet Identity login, logout, and stored identity retrieval.",
  "frontend/src/index.css": "Global Tailwind CSS setup defining theme variables, dark mode styles, accessibility focus styles, and print/reduced‑motion rules.",
  "frontend/src/main.tsx": "Initializes the React app, wrapping it with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/erp/academics/AssignmentsPage.tsx": "Simple page showing an Assignments header and card placeholder.",
  "frontend/src/pages/erp/academics/ClassSectionsPage.tsx": "Page for class section management with a header and placeholder card.",
  "frontend/src/pages/erp/academics/ExamSchedulePage.tsx": "Page displaying exam schedule section with a basic info card.",
  "frontend/src/pages/erp/academics/TimetableEditorPage.tsx": "Timetable editor placeholder page with header and card.",
  "frontend/src/pages/erp/admin/RoleAssignmentPage.tsx": "Provides UI placeholder for assigning ERP roles.",
  "frontend/src/pages/erp/announcements/AnnouncementsPage.tsx": "Announcements management placeholder page with a card layout.",
  "frontend/src/pages/erp/attendance/AttendanceOverviewPage.tsx": "Attendance overview page showing a card for viewing records.",
  "frontend/src/pages/erp/attendance/MarkAttendancePage.tsx": "Page for marking attendance with a basic placeholder card.",
  "frontend/src/pages/erp/DashboardPage.tsx": "Displays user profile info and several dashboard summary cards, with loading skeletons.",
  "frontend/src/pages/erp/ErpLoginPage.tsx": "Handles Internet Identity login/logout and redirects authenticated users into the ERP system.",
  "frontend/src/pages/erp/fees/FeesOverviewPage.tsx": "Displays a fee management overview card.",
  "frontend/src/pages/erp/fees/ReceiptPrintPage.tsx": "Renders a printable fee receipt using a dynamic feeId param.",
  "frontend/src/pages/erp/grades/GradebookPage.tsx": "Gradebook page showing student grade management placeholder.",
  "frontend/src/pages/erp/grades/ReportCardPrintPage.tsx": "Printable report card page using a dynamic studentId param.",
  "frontend/src/pages/erp/library/LibraryCatalogPage.tsx": "Library catalog placeholder page with a simple info card.",
  "frontend/src/pages/erp/library/LibraryLoansPage.tsx": "Displays a book loans management placeholder card.",
  "frontend/src/pages/erp/reports/AttendanceReportPage.tsx": "Attendance reporting page with a summary card.",
  "frontend/src/pages/erp/reports/FinancialSummaryReportPage.tsx": "Shows financial summary reporting via a placeholder card.",
  "frontend/src/pages/erp/reports/PerformanceReportPage.tsx": "Academic performance report page with a basic card.",
  "frontend/src/pages/erp/reports/ReportsIndexPage.tsx": "Index page linking to various ERP report types via cards.",
  "frontend/src/pages/erp/staff/LeaveRequestsPage.tsx": "Leave request management placeholder page with a header and card.",
  "frontend/src/pages/erp/staff/StaffDetailPage.tsx": "Displays staff details using a dynamic staffId param.",
  "frontend/src/pages/erp/staff/StaffListPage.tsx": "Staff list management placeholder page.",
  "frontend/src/pages/erp/students/StudentCreatePage.tsx": "Student registration form placeholder page.",
  "frontend/src/pages/erp/students/StudentDetailPage.tsx": "Displays basic student details using the studentId from route params.",
  "frontend/src/pages/erp/students/StudentIdCardPage.tsx": "Renders a styled student ID card using the studentId from route params.",
  "frontend/src/pages/erp/students/StudentsListPage.tsx": "Shows a students list placeholder with a button linking to the create page.",
  "frontend/src/pages/erp/timetable/MyTimetablePage.tsx": "Provides a simple timetable page showing a schedule placeholder.",
  "frontend/src/pages/payments/PaymentFailurePage.tsx": "Displays a payment failure message with a link back to the fees page.",
  "frontend/src/pages/payments/PaymentSuccessPage.tsx": "Shows a payment success confirmation and a button returning to the fees page.",
  "frontend/src/pages/public/AboutPage.tsx": "Presents detailed information about the academy including mission, vision, values, history, and accreditation.",
  "frontend/src/pages/public/AcademicsPage.tsx": "Displays academic program details across elementary, middle, and high school using tabbed content.",
  "frontend/src/pages/public/AdmissionsPage.tsx": "Outlines admissions information including process steps, required documents, dates, and financial aid.",
  "frontend/src/pages/public/CampusTourPage.tsx": "Provides a virtual 360° campus tour with selectable tour spots.",
  "frontend/src/pages/public/ContactPage.tsx": "Contains a contact form and displays address, phone, and email details.",
  "frontend/src/pages/public/EventsPage.tsx": "Lists upcoming school events with dates and descriptions.",
  "frontend/src/pages/public/FacultyPage.tsx": "Renders a faculty overview page listing leadership members with avatar cards and sections describing teaching philosophy and professional development.",
  "frontend/src/pages/public/GalleryPage.tsx": "Displays a grid-based gallery of campus and activity photos with hover overlays.",
  "frontend/src/pages/public/HomePage.tsx": "Implements the public home page with a 3D or fallback hero, feature cards, and quick navigation links.",
  "frontend/src/utils/urlParams.ts": "Provides utilities for reading, storing, and clearing URL and session-based parameters, including persistence helpers.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS theme, colors, animations, and plugins like typography and container queries.",
  "project_state.json": "Defines the project’s state, goals, architecture notes, assets, and implemented features for the school website and ERP system."
}